Revit.Elements.Element.IsPinned
Get the Element Pinned status

Revit.Elements.Element.AreJoined(Revit.Elements.Element)
Checks if two elements are joined
otherElement: Second element to check
Returns: True if the two elements are joined, False otherwise

Revit.Elements.Element.ElementType
Returns the ElementType for this Element. Returns null if the Element cannot have an ElementType assigned.
Element Type or Null.

Revit.Elements.Element.GetHashCode
Get hash code.
Returns:

Revit.Elements.Element.Delete(Revit.Elements.Element)
Delete the element and any elements that are totally dependent upon the element.
element: The element to delete.
Returns: The list of element id's deleted, including any dependent elements.
Throws System.ArgumentNullException: Thrown if element is null.

Revit.Elements.Element.GetHostedElements(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Gets all elements hosted by the supplied element
includeOpenings: Include rectangular openings in output
includeHostedElementsOfJoinedHosts: Include the hosted elements from the multiple joined hosts in output
includeEmbeddedWalls: Include embedded walls in output
includeSharedEmbeddedInserts: Include shared embedded elements in output
Returns: Hosted Elements

Revit.Elements.Element.SetPinnedStatus(System.Boolean)
Sets an existing element's pinned status
pinned: Value for pin status true/false

Revit.Elements.Element.GetChildElements
Gets the child Elements of the current Element.
Returns: Child Elements.

Revit.Elements.Element.GetParentElement
Gets the parent element of the Element.
Returns: Parent Element

Revit.Elements.Element.GetJoinedElements
Finds the elements whose geometry is joined with the given element.
Returns: All elements whose geometry is joined to the given element.

Revit.Elements.Element.GetIntersectingElementsOfCategory(Revit.Elements.Category)
Gets all Elements intersecting the input element, that are of a specific category.
category: Category of Elements to check intersection against
Returns: List of intersection elements of the specified category

Revit.Elements.Element.UnjoinGeometry(Revit.Elements.Element)
Unjoin the geometry of two Elements.
otherElement: Other element to unjoin from the element.
Returns: The input elements with their geometry unjoined.

Revit.Elements.Element.UnjoinAllGeometry(System.Collections.Generic.List{Revit.Elements.Element})
Unjoins the geometry of all elements from each other if they are joined.
This performs only one transaction in Revit.
elements: List of elements to unjoin from each other
Returns: All input Elements, with their geometry now unjoined from each other.

Revit.Elements.Element.SetGeometryJoinOrder(Revit.Elements.Element,Revit.Elements.Element)
Sets the order in which the geometry of two elements is joined.
cuttingElement: The element that should be cutting the other element
otherElement: The other element that is being cut by the cuttingElement
Returns: Input elements with the geometry join order updated.

Revit.Elements.Element.JoinGeometry(Revit.Elements.Element)
Joins the geometry of two elements, if they are intersecting.
otherElement: Other element to join with
Returns: The two joined elements

Revit.Elements.Element.GetLocation
Get an existing element's location
Returns: Location Geometry